; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v1 - type_3 ?v8 - type_1)
 	      (pred_3 ?v3 - object ?v8 - type_1)
	      (pred_4 ?v1 - type_3 ?v4 - type_2)
	      (pred_2 ?v1 - type_3 ?v3 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v1 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_1 ?v1 ?v7))
       :effect (and  (pred_1 ?v1 ?v2)
		     (not (pred_1 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_3 ?v6 - object ?v5 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v5) (pred_1 ?v1 ?v5) (pred_4 ?v1 ?v4))
       :effect (and (pred_2 ?v1 ?v6 ?v4)
		    (not (pred_3 ?v6 ?v5)) 
		    (not (pred_4 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_3 ?v6 - object ?v5 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v6 ?v4) (pred_1 ?v1 ?v5))
       :effect (and (pred_3 ?v6 ?v5)
		    (pred_4 ?v1 ?v4)
		    (not (pred_2 ?v1 ?v6 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_3
obj_03 obj_05 - type_2
obj_10 obj_09 obj_04 obj_01 - type_1
obj_02 obj_08 obj_07 - object)
(:init
(pred_1 obj_06 obj_01)
(pred_4 obj_06 obj_03)
(pred_4 obj_06 obj_05)
(pred_3 obj_02 obj_09)
(pred_3 obj_08 obj_10)
(pred_3 obj_07 obj_04)
)
(:goal
(and
(pred_3 obj_02 obj_09)
(pred_3 obj_08 obj_04)
(pred_3 obj_07 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_05))))
)
)

; plan
1. (op_1 obj_06 obj_01 obj_10)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_10)
   goals met: 1 of 3
2. (op_3 obj_06 obj_08 obj_10 obj_03)
   deleted: (pred_3 obj_08 obj_10) (pred_4 obj_06 obj_03)
   added: (pred_2 obj_06 obj_08 obj_03)
   goals met: 1 of 3
3. (op_1 obj_06 obj_10 obj_04)
   deleted: (pred_1 obj_06 obj_10)
   added: (pred_1 obj_06 obj_04)
   goals met: 1 of 3
4. (op_2 obj_06 obj_08 obj_04 obj_03)
   deleted: (pred_2 obj_06 obj_08 obj_03)
   added: (pred_3 obj_08 obj_04) (pred_4 obj_06 obj_03)
   goals met: 2 of 3
5. (op_3 obj_06 obj_07 obj_04 obj_03)
   deleted: (pred_3 obj_07 obj_04) (pred_4 obj_06 obj_03)
   added: (pred_2 obj_06 obj_07 obj_03)
   goals met: 2 of 3
6. (op_1 obj_06 obj_04 obj_01)
   deleted: (pred_1 obj_06 obj_04)
   added: (pred_1 obj_06 obj_01)
   goals met: 2 of 3
7. (op_2 obj_06 obj_07 obj_01 obj_03)
   deleted: (pred_2 obj_06 obj_07 obj_03)
   added: (pred_3 obj_07 obj_01) (pred_4 obj_06 obj_03)
   goals met: 3 of 3
